INSERT INTO genre (name)
	values('Русский реп'), ('Русский поп'), ('Русский рок'), ('Барды'), ('Металл');

INSERT INTO ARTIST (name)
	values('Баста'), ('Андрей Макаревич'), ('Ария'), ('Metallica'), ('Звери'), ('Ольга Бузова'), ('Григорий Лепс'), ('Олег Митяев');

INSERT INTO genre_artist (artist_id, genre_id)
	VALUES(1, 1), (2, 3), (3, 5), (4, 5), (5, 3), (6, 2), (7, 2), (8, 4);

INSERT INTO album (name, release_year)
	VALUES('Сансара', 2017), ('У ломбарда', 2013), ('Беспечный ангел', 2020), ('Master of puppets', 1986), ('Голод', 2003), ('Принимай меня', 2019), ('Подмена понятий ', 2021), ('The best', 2020);

INSERT INTO artist_album (artist_id, album_id)
	VALUES(1, 1), (2, 2), (3, 3), (4, 4), (5, 5), (6, 6), (7, 7), (8, 8);

INSERT INTO track (album_id, name, track_duration)
	VALUES(1, 'Сансара', '2:38'), (1, 'Осень', '3:20'), (2, 'Соловки', '2:17'), (2, 'Песня Нестора', '2:58'), (3, 'Там высоко', '3:30'), (3, 'Без тебя', '2:45'), (4, 'Battery', '2:47'), (4, 'Orion', '3:55'), (5, '120', '2:55'), (5, 'Для тебя', '3:15'), (6, 'WIFI', '2:20'), (6, 'По сердцу', '3:18'), (7, 'Всех благ', '2:47'), (7, 'Трибунал', '2:55'), (8, 'Дом мой', '3:19');

INSERT INTO collection (name, release_year)
	VALUES('Мои хиты', 2022), ('Свадебные песни', 2020), ('Песни после развода', 2018), ('Детские песни', 2017), ('Застольные хиты', 2000), ('Хиты 80-90е', 1998), ('Кому за 40', 2005), ('Избранное', 2021);

INSERT INTO track_collection (track_id, collection_id)
	VALUES(1, 3), (2, 3), (12, 3), (8, 1), (9, 1), (1, 1), (15, 2), (3, 2), (5, 2), (8, 2), (7, 2), (13, 2), (11, 2), (4, 2), (13, 4), (10, 4), (5, 4), (6, 5), (7, 5), (11, 6), (12,6), (8, 6), (2,6), (12, 7), (15, 7), (13,7), (3, 8), (2, 8), (10, 8), (12, 8);









